public class GBB3P {

	public static void main(String[] args) {
// 0 °¡À§, 1 ¹ÙÀ§, 2º¸		
/*
0 0 0 ¹«	0
0 0 1 ÆÐ	-1
0 0 2 ½Â	-2
0 1 0 ÆÐ	-1
0 2 0 ½Â	-2
0 1 1 ÆÐ	-2
0 1 2 ¹«	-3
0 2 1 ¹«	-3
0 2 2 ½Â	-4
---------
1 0 0 ½Â	1
1 0 1 ½Â	0
1 0 2 ¹«	-1
1 1 0 ½Â	0
1 2 0 ¹«	-1
1 1 1 ¹«	-1
1 1 2 ÆÐ	-2
1 2 1 ÆÐ	-2
1 2 2 ÆÐ	-3
-------------
2 0 0 ÆÐ	2
2 0 1 ¹«	1
2 0 2 ÆÐ	0
2 1 0 ¹«	1
2 2 0 ÆÐ	0
2 1 1 ½Â	0
2 1 2 ½Â	-1
2 2 1 ½Â	-1
2 2 2 ¹«	-2



*/
		int tak = 0;
		int yeon = (int)(Math.random()*3+1);
		int sub = (int)(Math.random()*3+1);
		
		String resultStr = 
		

	}
}
